# Циклы: задание 1

"""
Вывести в консоль таблицу умножения на 4
"""

print("Таблица умножения на 4:")
number = 4

for i in range(1, 11):
    print(number, " x ", i, " = ", (number * i))
