# Циклы: задание 5

"""
Пользователь вводит строку.
Выводим в консоль эту строку посимвольно (одна строка –
один символ)
"""

string = input("Введите строку: ")

for char in string:
    print(char)
